
&НаСервере
Процедура ПрочитатьXDTOНаСервере()
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(РеквизитФормыВЗначение("Объект").ПолучитьМакет("Модель").ПолучитьТекст());
	ОбъектModel = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	Фабрика = Новый ФабрикаXDTO(ОбъектModel);	
	ЧтениеXML.Закрыть();
	
	ТипXDTO = Фабрика.Тип("http://www.sample-package.org", "ТипОбъекта1");
	ОбъектXDTO = Фабрика.Создать(ТипXDTO);
	ОбъектXDTO.__content = 1;
	ОбъектXDTO.Атрибут = "Тестик";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("C:\Users\mzudin\Documents\Мой.xml");
	Фабрика.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	ЗаписьXML.Закрыть();
	
	ЧтениеXML.ОткрытьФайл("C:\Users\mzudin\Documents\Мой.xml");
	ОбъектXDTO = Фабрика.ПрочитатьXML(ЧтениеXML, ТипXDTO);
	ЧтениеXML.Закрыть();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Соощить();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьXDTO(Команда)
	ПрочитатьXDTOНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьМодельНаСервере()
	Объект = ФабрикаXDTO.ЭкспортМоделиXDTO("http://www.sample-package.org");
	
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл("C:\Users\mzudin\Documents\МояМодель.xml");
	
	// Запись с явным указанием необязательных параметров.
	ФабрикаXDTO.ЗаписатьXML(Запись, Объект,"Model","http://v8.1c.ru/8.1/xdto", , НазначениеТипаXML.Явное);
	
	Запись.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМодель(Команда)
	СоздатьМодельНаСервере();
КонецПроцедуры
